src/srv/backup/GetCollaborationSearchHits.request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:siem="Siemens.UnicoPlus.Lib.DataProvider">
   <soap:Header>
    <AuthTicket xmlns="Siemens.UnicoPlus.Lib.DataProvider">
	html5client
    </AuthTicket>
   </soap:Header>
   <soap:Body>
      <siem:GetCollaborationSearchHits>

         <siem:xmlSearchRequest>
<![CDATA[


<SearchRequest xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><CooperationStatusCondition><CheckFor exclude="false">1000</CheckFor></CooperationStatusCondition><FreeTextSearchCondition><CheckFor exclude="false">siemens</CheckFor></FreeTextSearchCondition></SearchRequest>


<SearchRequest xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><CountryCondition><CheckFor type="SiemensUnit">4</CheckFor></CountryCondition></SearchRequest>


]]>
	 </siem:xmlSearchRequest>

         <siem:calculateFilterValues>true</siem:calculateFilterValues>
         <siem:calculateReportResults>true</siem:calculateReportResults>

      </siem:GetCollaborationSearchHits>
   </soap:Body>
</soap:Envelope>
